////声明
//#include "threeGame.h"   //引用自己的头文件需要用双引号""
//#include <stdlib.h>
//#include <time.h>
//char iswin(char board[ROW][COL],int row,int col){
//	//赢的条件 ，横三，竖三，二斜，最后如果都没出现，就会下满平局
//	int i,j;
//	for(i=0;i<row;i++){
//		//横三，如果三个都是一样的，且不是空格，就返回其中一个的内容，最后再判断返回的是哪个就是谁赢
//		if(board[i][0] == board[i][1] && board[i][1] == board[i][2] && board[i][1] != ' '){
//			//return该自定义函数就结束了！！！！！！！！！！！
//			return board[i][1];
//		}
//		//竖三，同上
//		if(board[0][i] == board[1][i] && board[1][i] == board[2][i] && board[1][i] != ' '){
//			return board[1][i];
//		}
//	}
//	//二斜
//	if(board[0][0] == board[1][1] && board[1][1] == board[2][2] && board[1][1] != ' ')
//			return board[1][1];
//	if(board[0][2] == board[1][1] && board[1][1] == board[2][0] && board[1][1] != ' ')
//			return board[1][1];
//	//下满平局，如果出现下满有输赢的情况前面就一定会检查到
//	/*if(count == 9){
//		return 'd';
//	}*/                         //此方法无效，count无法重新计数，上一次游戏会加到下一次游戏
//	//棋盘满了就代表没有空格
//	//因为前面情况判断了就只剩两个情况，如果有空格就返回c继续下棋，如果遍历完了还没返回c就是没有空格了就可以返回平局
//	for(i=0;i<row;i++){
//		for(j=0;j<col;j++){
//			if(board[i][j] == ' '){
//				return 'c';
//			}
//		}
//	}
//	return 'd';
//}
//void computer_move(char board[ROW][COL],int row,int col){
//	do{
//		//得到两个随机数
//	int x,y;
//	x = rand()%3;
//	y = rand()%3;
//	//判断该坐标是否已经有值了  ---
//	if(board[x][y] == ' '){
//		board[x][y] = '#';
//		//count++;                            
//		printf("***************************电脑落子*************************\n");
//		break;
//	}
//	}while(1);
//}
//void display_board(char board[ROW][COL],int row, int col){
//	int i,j;
//	printf("************************************************************\n");
//	printf("*********************** ----------- ************************\n");
//
//	for(i=0;i<row;i++){
//		//打印要输入那一行的内容
//		
//		printf("***********************|");
//		for(j=0;j<col;j++){
//			printf(" ");
//			printf("%c",board[i][j]);
//			printf(" ");
//			if(j<col-1)
//				printf("|");
//		}
//		printf("|************************\n");
//		//打印内容下面那一行,最后一行不打印
//		if(i<row-1){
//			
//			printf("***********************|");
//			for(j=0;j<col;j++){
//				printf("---");
//				if(j<col-1)
//					printf("|");
//			}
//			printf("|************************\n");
//		}
//	}
//	printf("*********************** ----------- ************************\n");
//	printf("************************************************************\n");
//}
//void player_move(char board[ROW][COL],int row,int col){
//	int x,y;
//	do{
//		printf("****************请玩家落子(输入棋盘坐标):*******************>>>>");
//		scanf("%d%d",&x,&y);
//		//要对玩家输入的坐标进行判断  ---小于行列且坐标上是空格
//		if(x <= row && y <= col && board[x-1][y-1] == ' '){
//			board[x-1][y-1] = '*';
//			//count++;
//			break;
//		}else
//			printf("******************输入错误，请重新输入！********************\n");
//	}while(1);
//}
//void player1_move(char board[ROW][COL],int row,int col){
//	int x,y;
//	do{
//		printf("**************请一号玩家落子(输入棋盘坐标):*****************>>>>");
//		scanf("%d%d",&x,&y);
//		//要对玩家输入的坐标进行判断  ---小于行列且坐标上是空格
//		if(x <= row && y <= col && board[x-1][y-1] == ' '){
//			board[x-1][y-1] = '*';
//			break;
//		}else
//			printf("******************输入错误，请重新输入！********************\n");
//	}while(1);
//}
//void player2_move(char board[ROW][COL],int row,int col){
//	int x,y;
//	do{
//		printf("**************请二号玩家落子(输入棋盘坐标):*****************>>>>");
//		scanf("%d%d",&x,&y);
//		//要对玩家输入的坐标进行判断  ---小于行列且坐标上是空格
//		if(x <= row && y <= col && board[x-1][y-1] == ' '){
//			board[x-1][y-1] = '#';
//			break;
//		}else
//			printf("******************输入错误，请重新输入！********************\n");
//	}while(1);
//}
//void init_board(char board[ROW][COL],int row, int col){
//	int i,j;
//	printf("************************************************************\n");
//	printf("*********************** ----------- ************************\n");
//
//	for(i=0;i<row;i++){
//		//打印要输入那一行的内容
//		
//		printf("***********************|");
//		for(j=0;j<col;j++){
//			board[i][j]=' ';
//			printf(" ");
//			printf("%c",board[i][j]);
//			printf(" ");
//			if(j<col-1)
//				printf("|");
//		}
//		printf("|************************\n");
//		//打印内容下面那一行,最后一行不打印
//		if(i<row-1){
//			
//			printf("***********************|");
//			for(j=0;j<col;j++){
//				printf("---");
//				if(j<col-1)
//					printf("|");
//			}
//			printf("|************************\n");
//		}
//	}
//	printf("*********************** ----------- ************************\n");
//	printf("************************************************************\n");
//}
//void pve(){
//	char ret;
//	//创建一个棋盘
//	char board[ROW][COL]={0};
//	//取时间戳作为随机的种子
//	srand((unsigned int) time(NULL));
//	//初始化棋盘+展示棋盘
//	init_board(board,ROW,COL);
//	
//	do{
//		//玩家下棋
//		player_move(board,ROW,COL);
//		//显示棋盘
//		display_board(board,ROW,COL);
//		//判断输赢
//		ret = iswin(board,ROW,COL);
//		if(ret == '*'){               //煞币！！！！！！！！ =是赋值语句 应该用 == 判断
//			printf("**************************玩家获胜**************************\n");
//			break;
//		}
//		else if(ret == '#'){
//			printf("**************************电脑获胜**************************\n");
//			break;
//		}
//		else if(ret == 'd'){
//			printf("****************************平局****************************\n");
//			break;
//		}
//		//电脑下棋
//		computer_move(board,ROW,COL);
//		//显示棋盘
//		display_board(board,ROW,COL);
//		//判断输赢
//		ret = iswin(board,ROW,COL);
//		if(ret == '*'){
//			printf("**************************玩家获胜**************************\n");
//			break;
//		}
//		else if(ret == '#'){
//			printf("**************************电脑获胜**************************\n");
//			break;
//		}
//		else if(ret == 'd'){
//			printf("****************************平局****************************\n");
//			break;
//		}
//	}while(ret == 'c');
//}
//void menu(){
//	printf("************************************************************\n");
//	printf("****************|--------------------------|****************\n");
//	printf("****************|  1.pve   2.pvp   0.quit  |****************\n");
//	printf("****************|--------------------------|****************\n");
//	printf("************************************************************\n");
//	printf("************************************************************\n");
//	printf("******************|----------------------|******************\n");
//	printf("******************|    请输入你的选择：  |******************\n");
//	printf("******************|----------------------|******************\n");
//	printf("************************************************************>>>>");
//}
//void pvp(){
//	char ret;
//	//创建一个棋盘
//	char board[ROW][COL]={0};
//	//取时间戳作为随机的种子
//	srand((unsigned int) time(NULL));
//	//初始化棋盘+展示棋盘
//	init_board(board,ROW,COL);
//	
//	do{
//		
//		//玩家下棋
//		player1_move(board,ROW,COL);
//		//显示棋盘
//		display_board(board,ROW,COL);
//		//判断输赢
//		ret = iswin(board,ROW,COL);
//		if(ret == '*'){               //煞币！！！！！！！！ =是赋值语句 应该用 == 判断
//			printf("************************一号玩家获胜************************\n");
//			break;
//		}
//		else if(ret == '#'){
//			printf("************************二号玩家获胜************************\n");
//			break;
//		}
//		else if(ret == 'd'){
//			printf("*****************************平局***************************\n");
//			break;
//		}
//		//电脑下棋
//		player2_move(board,ROW,COL);
//		//显示棋盘
//		display_board(board,ROW,COL);
//		//判断输赢
//		ret = iswin(board,ROW,COL);
//		if(ret == '*'){
//			printf("************************一号玩家获胜************************\n");
//			break;
//		}
//		else if(ret == '#'){
//			printf("************************二号玩家获胜************************\n");
//			break;
//		}
//		else if(ret == 'd'){
//			printf("*****************************平局***************************\n");
//			break;
//		}
//	}while(ret == 'c');
//}